#+TITLE: Section 1.2 Exercises

** Solution
#+begin_src scheme
(load-from-path "1_22-definitions.scm")
(define (search-for-primes start)
  (define (search-for-primes-iter n count)
    (if (> count 0)
        (search-for-primes-iter
         (+ n 2)
         (if (timed-prime-test n) (- count 1) count))))
  (search-for-primes-iter
   (if (divides? 2 start) (+ start 1) start)
   3))
#+end_src

#+begin_example
> (search-for-primes 100000)
100003 | 71004
100019 | 69836
100043 | 69686

> (search-for-primes 1000000)
1000003 | 413345
1000033 | 417740
1000037 | 417630

> (search-for-primes 10000000)
10000019 | 692164
10000079 | 673696
10000103 | 697857

> (search-for-primes 100000000)
100000007 | 1731865
100000037 | 1448142
100000039 | 1630682
#+end_example

Let m be the mean time for the three smallest primes greater than 100000 and T_n to be the measured time (in nanoseconds) to check for primality of n. If m is taken take as the standard computation time for prime test, the deviation, D_n, from the expected computation time is:

\[
D_n = T_n - m\left(\frac{\sqrt{n}}{\sqrt{100000}}\right)
\]

Observed mean:
m = 70175

|         n | T_n (ns) |           D_n |
|-----------+----------+---------------|
|   1000003 |   413345 |     191431.83 |
|   1000033 |   417740 |     195823.50 |
|   1000037 |   417630 |     195713.06 |
|  10000019 |   692164 |    -9586.6667 |
|  10000079 |   673696 |    -28056.772 |
|  10000103 |   697857 |    -3896.6140 |
| 100000007 |  1731865 |    -487263.43 |
| 100000037 |  1448142 |    -770986.76 |
| 100000039 |  1630682 |    -588446.78 |
|-----------+----------+---------------|
|  Variance |       -- | 137875470000. |
#+tblfm: $3=$2-70175*(sqrt($1)/sqrt(100000))::@11$3=vvar(@I..@II)

** Solution
#+begin_src scheme :eval query
(load-from-path "1_23-definitions.scm")
(search-for-primes 100000)
(search-for-primes 1000000)
(search-for-primes 10000000)
(search-for-primes 100000000)
#+end_src

#+RESULTS:
#+begin_example
100003 | 28128
100019 | 10090
100043 | 10186
1000003 | 29715
1000033 | 29531
1000037 | 29554
10000019 | 91376
10000079 | 91356
10000103 | 91318
100000007 | 289935
100000037 | 289866
100000039 | 301755
#+end_example


|         n | T_n (ns) | T2_n (ns) |   T_n/T2_n |
|-----------+----------+-----------+------------|
|    100003 |    71004 |     28128 |  1.7497720 |
|    100019 |    69836 |     10090 |  1.7098227 |
|    100043 |    69686 |     10186 |  1.8632122 |
|   1000003 |   413345 |     29715 |  3.6276472 |
|   1000033 |   417740 |     29531 |  3.7525377 |
|   1000037 |   417630 |     29554 |  3.7956357 |
|  10000019 |   692164 |     91376 |  1.1983781 |
|  10000079 |   673696 |     91356 |  1.1906816 |
|  10000103 |   697857 |     91318 |  1.1779986 |
| 100000007 |  1731865 |    289935 |  1.5999182 |
| 100000037 |  1448142 |    289866 | 0.68569829 |
| 100000039 |  1630682 |    301755 | 0.74455436 |
#+TBLFM: $4=$2/$3

** Solution
#+begin_src scheme :eval query
(load-from-path "1_24-definitions.scm")
(timed-prime-test 100003)
(timed-prime-test 100019)
(timed-prime-test 100043)
(timed-prime-test 1000003)
(timed-prime-test 1000033)
(timed-prime-test 1000037)
(timed-prime-test 10000019)
(timed-prime-test 10000079)
(timed-prime-test 10000103)
(timed-prime-test 100000007)
(timed-prime-test 100000037)
(timed-prime-test 100000039)
#+end_src

#+RESULTS:
#+begin_example
100003 | 14723
100019 | 28481
100043 | 6019
1000003 | 4187
1000033 | 4104
1000037 | 4228
10000019 | 6296
10000079 | 5024
10000103 | 4929
100000007 | 5661
100000037 | 5435
100000039 | 7817
#+end_example

\[
D_n = \frac{T3_n}{T2_n} - \frac{\log{n}}{\sqrt{n}}
\]

|         n | T2_n (ns) | T3_n (ns) |         D_n |
|-----------+-----------+-----------+-------------|
|    100003 |     28128 |      1472 | 0.015925580 |
|    100019 |     10090 |      2848 |  0.24585545 |
|    100043 |     10186 |      6019 |  0.55450849 |
|   1000003 |     29715 |      4187 |  0.12708977 |
|   1000033 |     29531 |      4104 |  0.12515729 |
|   1000037 |     29554 |      4228 |  0.12924487 |
|  10000019 |     91376 |      6296 | 0.063805134 |
|  10000079 |     91356 |      5024 | 0.049896679 |
|  10000103 |     91318 |      4929 | 0.048879249 |
| 100000007 |    289935 |      5661 | 0.017682998 |
| 100000037 |    289866 |      5435 | 0.016907975 |
| 100000039 |    301755 |      7817 | 0.024063054 |
#+tblfm: $4=$3/$2 - log($1)/sqrt($1)

